In [5]:
import pandas as pd

In [6]:
Dine_In_Data = pd.read_csv('./Dine In.csv')
Rooms_In_Data = pd.read_csv('./Rooms.csv')
TakeAway_In_Data = pd.read_csv('./Take Away.csv')
Bar_Data=pd.read_csv('./Bar.csv')

In [7]:
Dine_In_Data['Date'] = pd.to_datetime(Dine_In_Data['Date'], format='%d-%m-%y')
Rooms_In_Data['Date'] = pd.to_datetime(
    Rooms_In_Data['Date'], format='%d-%m-%y')
TakeAway_In_Data['Date'] = pd.to_datetime(
    TakeAway_In_Data['Date'], format='%d-%m-%y')
Bar_Data['Date'] = pd.to_datetime(
    Bar_Data['Date'], format='%d-%m-%y')

In [8]:
Dine_In_Amount = pd.DataFrame(
    Dine_In_Data['Dine In Amount'].groupby(Dine_In_Data['Date']).sum())
Room_Amount = pd.DataFrame(
    Rooms_In_Data['Room Amount'].groupby(Rooms_In_Data['Date']).sum())
Takeaway_Amount = pd.DataFrame(
    TakeAway_In_Data['Takeaway Amount'].groupby(TakeAway_In_Data['Date']).sum())
Bar_Amount = pd.DataFrame(
    Bar_Data['Bar Amount'].groupby(Bar_Data['Date']).sum())

In [9]:
data = pd.merge(Room_Amount, Dine_In_Amount, on='Date', how='outer')
data = pd.merge(data, Takeaway_Amount, on='Date', how='outer')
data = pd.merge(data, Bar_Amount, on='Date', how='outer')

In [10]:
data.sort_values(by='Date', inplace=True)
data.head()

            Room Amount  Dine In Amount  Takeaway Amount  Bar Amount
Date
2013-09-01          NaN         53722.0              NaN      7760.0
2013-09-02          NaN         39137.0              NaN     25239.0
2013-09-03          NaN           597.0              NaN      4127.0
2013-09-04          NaN             NaN              NaN      2273.0
2013-09-05          NaN          4999.0              NaN     12505.0

In [11]:
data.to_excel('Dataset.xlsx')